//==========================================================================
//文件名称：iwdg.c
//功能概要：STM32L431RC 独立看门狗底层驱动程序头文件
//版权所有：苏州大学飞思卡尔嵌入式中心(sumcu.suda.edu.cn)
//==========================================================================
#include "iwdg.h"

// ===========================================================================
// 函数名称：iwdg_init
// 函数参数：prer:分频系数（WDGTB）,仅最低2位有效； rlr:分频数：IWDG_PRESCALER_4~IWDG_PRESCALER_256
// 函数返回：无
// 功能概要： 初始化独立看门狗，传入需要的参数设置。定时时间=((4*2^prer)*rlr)/32 (ms).
//IWDG_PRESCALER_64, 200000
// ===========================================================================
void iwdg_init(uint_8 prer, uint_16 rlr){
	IWDG->KR = IWDG_KEY_WRITE_ACCESS_ENABLE;    
	IWDG->PR = prer;              
	IWDG->RLR = rlr;              
	IWDG->KR = IWDG_KEY_RELOAD;    
	IWDG->KR = IWDG_KEY_ENABLE;    
}

// ===========================================================================
// 函数名称：iwdg_feed
// 函数参数：无
// 函数返回：无
// 功能概要： 喂狗，重载计时器
// ===========================================================================
void iwdg_feed(void){
	IWDG->KR = IWDG_KEY_RELOAD;   
}
