//=====================================================================
//文件名称：isr.c（中断处理程序源文件）
//框架提供：SD-ARM（sumcu.suda.edu.cn）
//版本更新：20170801-20191020
//功能描述：提供中断处理程序编程框架
//=====================================================================
#include "../08_NosPrg/includes.h"

void EXTI9_5_IRQHandler(void)
{
	
	DISABLE_INTERRUPTS;     
	
		 
	

	       
   //------------------------------------------------------------------
	ENABLE_INTERRUPTS;    
}






void WWDG_IRQHandler(void)
{
	WWDG->SR=0X00;    //清空中断标志位
	printf("窗口看门狗复位");
}
/*
 知识要素：
 1.本文件中的中断处理函数调用的均是相关设备封装好的具体构件，在更换芯片
 时，只需保证设备的构件接口一致，即可保证本文件的相关中断处理函数不做任何
 更改，从而达到芯片无关性的要求。
 */
