//======================================================================
//文件名称：main.c（应用工程主函数）
//框架提供：SD-ARM（sumcu.suda.edu.cn）
//版本更新：20200402
//功能描述：见本工程的<01_Doc>文件夹下Readme.txt文件
//======================================================================
#define GLOBLE_VAR
#include "../08_NosPrg/includes.h"	//包含总头文件
  

//----------------------------------------------------------------------
//主函数
int main(void)
{
//（1）======启动部分（开头）=========================================


//（1.2）【不变】关总中断
	DISABLE_INTERRUPTS; 

//（1.3）给主函数使用的局部变量赋初值


//（1.4）给全局变量赋初值

//（1.5）用户外设模块初始化
   	MX_X_CUBE_AI_Init();	//初始化模型及参数
	Delay_ms(200);

//（1.6）使能模块中断

//（1.7）开总中断
    ENABLE_INTERRUPTS;
    
	
//（1）======启动部分（结尾）==========================================

//（2）======主循环部分（开头）========================================
	for(;;)
	{
		
	//(2.1)显示模型推理
		MX_X_CUBE_AI_Process();
	} 
	//（2）======主循环部分（结尾）========================================
} //main函数（结尾）

